title: GTFOBins privilege escalation in Linux Shell Commands
description: Detects suspicious shell commands used in GTFOBins privilege escalation methods (see references) - E keyword v2 of https://gtfobins.github.io/
references:
    - https://gtfobins.github.io/
    - https://in.security/using-auditbeat-and-elk-to-monitor-gtfobins-binaries/
author: Aye Hein Zayar
date: 2020/03/19
modified: 2020/06/10
logsource:
    product: linux
detection:
    keywords:
    # GTFOBins suspicious shell commands - e commands
    - 'eb logs'
    - 'emacs -Q -nw --eval * /bin/sh'
    - 'env /bin/sh'
    - 'expect -c * spawn /bin/sh'
    - 'expect -c * spawn /bin/sh;interact'
    # GTFOBins non-interactive reverse shell
    - 'bash -c * /dev/tcp/'
    - 'cpan * socket'
    # GTFOBins file download
    - 'echo * import OS; os.execl'
    # GTFOBins file upload
    - 'cancel -u'
    # GTFOBins file write
    - 'csh -c * echo'
    # GTFOBins file read
    - 'base64 * base64 --decode'
    - 'diff --line-format=%L /dev/null'
    # GTFOBins Library Load
    - 'echo * from ctypes import cdll * cdll.LoadLibrary * lib.so'
    # GTFOBins Sudo
    - 'sudo easy_install'
    - 'sudo eb logs'
    - 'sudo ed'
    - 'sudo env /bin/sh'
    - 'sudo eqn'
    - 'sudo expand'
    - 'sudo expect -c * spawn /bin/sh;interact'
    # GTFOBins limited SUID
    - 'sudo sh -c * cp $(which ed) * chmod +s ./ed'
    # GTFOBIns SUID
    - 'sudo sh -c * cp $(which env) * chmod +s ./env'
    - 'sudo sh -c * cp $(which eqn) * chmod +s ./eqn'
    - 'sudo sh -c * cp $(which expand) * chmod +s ./expand'
    - 'sudo sh -c * cp $(which expect) * chmod +s ./expect'
    condition: keywords
falsepositives:
    - Administrative Controls
level: low
tags:
    - attack.gtfobins_commands_execution
